// todo: Обработать событие записи объекта как интерактивно, так и получение оповещения о записи,
// нужно обновить идентификаторы, хеши и ТребуетсяСинхронизироватьССервером
// todo: На ядро (расширение) наложить ограничения, его интерактивно редактировать нельзя

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторЛокальныйСтрока = Объект.ИдентификаторЛокальный;
	ИдентификаторСерверныйСтрока = Объект.ИдентификаторСерверный;
	
	ТребуетсяСинхронизироватьССервером = ТребуетсяСинхронизироватьССервером();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ОтправитьРасширениеВДиспетчерНаСервере()	
	
	Если Объект.Ссылка.Пустая() Тогда		
		Ядро_Сервер.СообщитьПользователюОбОшибке("НеВозможноОтправитьРасширениеВДиспетчерЭлементСправочникаНеЗаписан");
		Возврат;
	КонецЕсли;
	
	Ядро_Сервер.ОтправитьРасширениеВДиспетчер(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьРасширениеВДиспетчер(Команда)
	ОтправитьРасширениеВДиспетчерНаСервере();
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// todo: Описание
&НаСервере
Функция ТребуетсяСинхронизироватьССервером()

	// todo: сделать по красоте, без разыменования, аналог БСП ЗначениеРеквизитаОбъекта()
	Возврат Объект.ХешЛокальный <> Объект.ХешСерверный;

КонецФункции

#КонецОбласти

