// todo: Список упросить, текст заменить иконками
// todo: Обработать ситуацию интерактивного изменение реквизитов расширения, допустим сменили наименование

#Область ОписаниеПеременных
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Ядро_Сервер.ОбновитьРасширенияЯдра();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Ядро_ ОбновитьСписокРасширений" Тогда
		ОбновитьСписок();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИмяТаблицыФормы
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСписокРасширений(Команда)
	
	Ядро_Сервер.ОбновитьРасширенияЯдра();
	ОбновитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМагазинРасширений(Команда)
	ОткрытьФорму("Справочник.Ядро_Расширения.Форма.МагазинРасширений");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьСписок()
	Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти